In [2]:
import pandas as pd

df = pd.DataFrame({'ID': ['H241', 'H143', 'H324', 'H324', 'H415'],
                        'Math': [17.5, 19, 14, 16, 11],
                        'Physics': [19, 13.5, 16.5, 12, 17],
                        'Chemistry': [16, 19, 16, 17, 11],
                        'Arts': [15, 18, 19, 12, 18]}, index=['Martin', 'Julia', 'Rachel', 'Koko', 'Anna'])
df

          ID  Math  Physics  Chemistry  Arts
Martin  H241  17.5     19.0         16    15
Julia   H143  19.0     13.5         19    18
Rachel  H324  14.0     16.5         16    19
Koko    H324  16.0     12.0         17    12
Anna    H415  11.0     17.0         11    18

In [43]:
df.iloc[1:3, 2:4]    # this gives a DataFrame

        Physics  Chemistry
Julia      13.5         19
Rachel     16.5         16

In [6]:
df.iloc[:, -1:]

        Arts
Martin    15
Julia     18
Rachel    19
Koko      12
Anna      18

In [7]:
df.iloc[:, :-1]

          ID  Math  Physics  Chemistry
Martin  H241  17.5     19.0         16
Julia   H143  19.0     13.5         19
Rachel  H324  14.0     16.5         16
Koko    H324  16.0     12.0         17
Anna    H415  11.0     17.0         11

In [11]:
df.iloc[0]

ID           H241
Math         17.5
Physics      19.0
Chemistry      16
Arts           15
Name: Martin, dtype: object

In [9]:
df.iloc[[0, 3]]

          ID  Math  Physics  Chemistry  Arts
Martin  H241  17.5     19.0         16    15
Koko    H324  16.0     12.0         17    12

In [10]:
df.iloc[0:3]

          ID  Math  Physics  Chemistry  Arts
Martin  H241  17.5     19.0         16    15
Julia   H143  19.0     13.5         19    18
Rachel  H324  14.0     16.5         16    19

In [12]:
df.iloc[-1:, :]

        ID  Math  Physics  Chemistry  Arts
Anna  H415  11.0     17.0         11    18

In [13]:
df.iloc[:-1, :]

          ID  Math  Physics  Chemistry  Arts
Martin  H241  17.5     19.0         16    15
Julia   H143  19.0     13.5         19    18
Rachel  H324  14.0     16.5         16    19
Koko    H324  16.0     12.0         17    12

In [14]:
df.iloc[-1:, [1, 3, 4]]

      Math  Chemistry  Arts
Anna  11.0         11    18

In [15]:
df.iloc[[1, 3], [1, 3, 4]]

       Math  Chemistry  Arts
Julia  19.0         19    18
Koko   16.0         17    12

In [16]:
df.loc['Julia']

ID           H143
Math         19.0
Physics      13.5
Chemistry      19
Arts           18
Name: Julia, dtype: object

In [65]:
df.loc['Julia'].tolist()[1:]

[19.0, 13.5, 19, 18]

In [58]:
df.loc['Rachel':'Anna']

          ID  Math  Physics  Chemistry  Arts
Rachel  H324  14.0     16.5         16    19
Koko    H324  16.0     12.0         17    12
Anna    H415  11.0     17.0         11    18

In [50]:
df.loc[['Julia', 'Koko']]

         ID  Math  Physics  Chemistry  Arts
Julia  H143  19.0     13.5         19    18
Koko   H324  16.0     12.0         17    12

In [20]:
df.loc['Julia', 'Math']

19.0

In [60]:
df[1:3]

          ID  Math  Physics  Chemistry  Arts
Julia   H143  19.0     13.5         19    18
Rachel  H324  14.0     16.5         16    19

In [61]:
df[2:4]

          ID  Math  Physics  Chemistry  Arts
Rachel  H324  14.0     16.5         16    19
Koko    H324  16.0     12.0         17    12

In [26]:
df[['ID', 'Arts']]

          ID  Arts
Martin  H241    15
Julia   H143    18
Rachel  H324    19
Koko    H324    12
Anna    H415    18

In [62]:
df['Math']

Martin    17.5
Julia     19.0
Rachel    14.0
Koko      16.0
Anna      11.0
Name: Math, dtype: float64

In [28]:
df['Math'].tolist()

[17.5, 19.0, 14.0, 16.0, 11.0]

In [53]:
n = df.index.get_loc('Koko')
df.iloc[:n+1, :]

          ID  Math  Physics  Chemistry  Arts
Martin  H241  17.5     19.0         16    15
Julia   H143  19.0     13.5         19    18
Rachel  H324  14.0     16.5         16    19
Koko    H324  16.0     12.0         17    12

In [66]:
rr = df.index.tolist()
for i in rr:
    print(i)
    print(df.loc[i].tolist())

Martin
['H241', 17.5, 19.0, 16, 15]
Julia
['H143', 19.0, 13.5, 19, 18]
Rachel
['H324', 14.0, 16.5, 16, 19]
Koko
['H324', 16.0, 12.0, 17, 12]
Anna
['H415', 11.0, 17.0, 11, 18]

In [40]:
cc = df.columns.tolist()
for i in cc:
    print(i)
    print(df[i].tolist())

ID
['H241', 'H143', 'H324', 'H324', 'H415']
Math
[17.5, 19.0, 14.0, 16.0, 11.0]
Physics
[19.0, 13.5, 16.5, 12.0, 17.0]
Chemistry
[16, 19, 16, 17, 11]
Arts
[15, 18, 19, 12, 18]

In [64]:
val = df.values.tolist() # a large list with each row converted to a list
val

[['H241', 17.5, 19.0, 16, 15],
 ['H143', 19.0, 13.5, 19, 18],
 ['H324', 14.0, 16.5, 16, 19],
 ['H324', 16.0, 12.0, 17, 12],
 ['H415', 11.0, 17.0, 11, 18]]

In [54]:
val[0][1:]

[17.5, 19.0, 16, 15]